BEGIN;

TRUNCATE listings_category RESTART IDENTITY CASCADE;
TRUNCATE listings_location RESTART IDENTITY CASCADE;

INSERT INTO listings_category (name, delivery_price) VALUES
('Авто', 1500),
('Телефони', 120),
('Меблі', 800),
('Одяг', 80),
('Комп''ютери', 300),
('Нерухомість', 0),
('Побутова техніка', 600),
('Інструменти', 250),
('Спорт', 200),
('Ігри', 100),
('Тварини', 400),
('Сад', 350),
('Аксесуари', 90),
('Робота', 1000),
('Рослини', 180);

INSERT INTO listings_location (city, latitude, longitude) VALUES
('Київ', 50.45, 30.52),
('Харків', 49.99, 36.23),
('Львів', 49.84, 24.03),
('Дніпро', 48.45, 34.98),
('Одеса', 46.48, 30.73),
('Миколаїв', 46.97, 31.99),
('Закарпаття', 48.62, 22.29),
('Вінниця', 49.23, 28.48),
('Житомир', 50.27, 28.66),
('Чернігів', 51.50, 31.28),
('Полтава', 49.59, 34.55),
('Херсон', 46.63, 32.62),
('Черкаси', 49.44, 32.06);

COMMIT;